

define(function(require,exports,module) {
    // require: 模块之间依赖的接口，当引入是sea下面的模块，require执行完结果就是exports
    // exports: 对外提供接口对象
    function run() {
        alert(1)
    }
    exports.run = run;
})


var cry1 = 26+41+30+100+96+100+30+150; //550
var cry2 = 60+100+100+18.8+161+188+120+18+100+20+20+30+245+22;  //1200
var cry3 = 50+120+20+64+17+80+50+186+40+110+93+22+201+220;  //1273
//cry 3020

var hp1 = 76+21+110+100+200+53+38;//598
var hp2 = 100+26+59+29+160+91;//465
var hp3 = 77+43+50+116+162+290;//738
//hp 1801

var wangyi = 1200 + 195*2 + 200+ 750; //2530
var eat = 18 * 22 * 4 + 200 * 4;//2400

var qiankuan = -1000 - 1672 - 472;
// 欠款 2672

var shoukuan = 500 + 100;
// 未收 600  余粮 400

//消费 9742 + 健身房 6400 + 房租6000 + 交公 10000 = 32142
//工资 6700+7700+8000*2+600 = 31000
//
var koudai = 31000 - 32142 - 2672;
// alert(koudai)//-3814